HotelXML/6098Image_sessioncreate-RQ.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsd="http://www.w3.org/1999/XMLSchema"><SOAP-ENV:Header><eb:MessageHeader SOAP-ENV:mustUnderstand="1" eb:version="1.0"><eb:ConversationId>Session</eb:ConversationId><eb:From><eb:PartyId type="urn:x12.org:IO5:01">WebServiceClient</eb:PartyId></eb:From><eb:To><eb:PartyId type="urn:x12.org:IO5:01">WebServiceSupplier</eb:PartyId></eb:To><eb:CPAId>K4EF</eb:CPAId><eb:Service eb:type="OTA">SessionCreateRQ</eb:Service><eb:Action>SessionCreateRQ</eb:Action><eb:MessageData><eb:MessageId>mid:20001209-133003-2333@clientofsabre.com1</eb:MessageId><eb:Timestamp>2018-08-04T07:36:50Z</eb:Timestamp><eb:TimeToLive>2018-08-04T07:36:50Z</eb:TimeToLive></eb:MessageData></eb:MessageHeader><wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility"><wsse:UsernameToken><wsse:Username>360194</wsse:Username><wsse:Password>WS682492</wsse:Password><Organization>K4EF</Organization><Domain>DEFAULT</Domain></wsse:UsernameToken></wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body><eb:Manifest SOAP-ENV:mustUnderstand="1" eb:version="1.0"><eb:Reference xmlns:xlink="http://www.w3.org/1999/xlink" xlink:href="cid:rootelement" xlink:type="simple" /></eb:Manifest></SOAP-ENV:Body></SOAP-ENV:Envelope>